{
    "architectures": [
        "Qwen3_5MoeForConditionalGeneration"
    ],
    "eos_token_id": [
        248046,
        248044
    ],
    "image_token_id": 248056,
    "model_type": "qwen3_5_moe",
    "quantization": {
        "group_size": 64,
        "bits": 4,
        "mode": "affine",
        "language_model.model.layers.0.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.0.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.1.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.1.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.2.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.2.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.3.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.3.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.4.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.4.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.5.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.5.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.6.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.6.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.7.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.7.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.8.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.8.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.9.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.9.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.10.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.10.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.11.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.11.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.12.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.12.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.13.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.13.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.14.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.14.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.15.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.15.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.16.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.16.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.17.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.17.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.18.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.18.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.19.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.19.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.20.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.20.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.21.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.21.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.22.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.22.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.23.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.23.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.24.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.24.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.25.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.25.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.26.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.26.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.27.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.27.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.28.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.28.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.29.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.29.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.30.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.30.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.31.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.31.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.32.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.32.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.33.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.33.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.34.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.34.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.35.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.35.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.36.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.36.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.37.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.37.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.38.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.38.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.39.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.39.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        }
    },
    "quantization_config": {
        "group_size": 64,
        "bits": 4,
        "mode": "affine",
        "language_model.model.layers.0.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.0.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.1.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.1.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.2.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.2.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.3.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.3.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.4.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.4.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.5.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.5.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.6.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.6.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.7.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.7.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.8.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.8.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.9.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.9.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.10.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.10.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.11.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.11.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.12.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.12.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.13.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.13.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.14.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.14.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.15.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.15.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.16.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.16.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.17.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.17.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.18.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.18.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.19.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.19.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.20.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.20.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.21.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.21.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.22.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.22.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.23.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.23.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.24.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.24.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.25.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.25.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.26.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.26.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.27.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.27.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.28.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.28.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.29.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.29.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.30.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.30.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.31.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.31.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.32.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.32.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.33.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.33.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.34.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.34.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.35.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.35.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.36.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.36.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.37.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.37.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.38.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.38.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.39.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "language_model.model.layers.39.mlp.shared_expert_gate": {
            "group_size": 64,
            "bits": 8
        }
    },
    "text_config": {
        "attention_bias": false,
        "attention_dropout": 0.0,
        "attn_output_gate": true,
        "bos_token_id": 248044,
        "dtype": "bfloat16",
        "eos_token_id": 248044,
        "full_attention_interval": 4,
        "head_dim": 256,
        "hidden_act": "silu",
        "hidden_size": 2048,
        "initializer_range": 0.02,
        "layer_types": [
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention"
        ],
        "linear_conv_kernel_dim": 4,
        "linear_key_head_dim": 128,
        "linear_num_key_heads": 16,
        "linear_num_value_heads": 32,
        "linear_value_head_dim": 128,
        "mamba_ssm_dtype": "float32",
        "max_position_embeddings": 262144,
        "model_type": "qwen3_5_moe_text",
        "moe_intermediate_size": 512,
        "mtp_num_hidden_layers": 1,
        "mtp_use_dedicated_embeddings": false,
        "num_attention_heads": 16,
        "num_experts": 256,
        "num_experts_per_tok": 8,
        "num_hidden_layers": 40,
        "num_key_value_heads": 2,
        "output_router_logits": false,
        "pad_token_id": null,
        "partial_rotary_factor": 0.25,
        "rms_norm_eps": 1e-06,
        "rope_parameters": {
            "mrope_interleaved": true,
            "mrope_section": [
                11,
                11,
                10
            ],
            "partial_rotary_factor": 0.25,
            "rope_theta": 10000000,
            "rope_type": "default"
        },
        "router_aux_loss_coef": 0.001,
        "shared_expert_intermediate_size": 512,
        "tie_word_embeddings": false,
        "use_cache": true,
        "vocab_size": 248320
    },
    "tie_word_embeddings": false,
    "transformers_version": "4.57.1",
    "video_token_id": 248057,
    "vision_config": {
        "deepstack_visual_indexes": [],
        "depth": 27,
        "hidden_act": "gelu_pytorch_tanh",
        "hidden_size": 1152,
        "in_channels": 3,
        "initializer_range": 0.02,
        "intermediate_size": 4304,
        "model_type": "qwen3_5_moe",
        "num_heads": 16,
        "num_position_embeddings": 2304,
        "out_hidden_size": 2048,
        "patch_size": 16,
        "spatial_merge_size": 2,
        "temporal_patch_size": 2
    },
    "vision_end_token_id": 248054,
    "vision_start_token_id": 248053
}